# KVA Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KVA Property
SymbolTypeId Class See Also
---
Symbol kVA, indicating unit Kilovolt amperes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KVA { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KVA As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KVA {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace